---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.VelocityPressure
source: html/85780c81-b503-1b4d-5876-f70fc72e508e.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.VelocityPressure Property

The connector velocity pressure. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```